RUN_STRINGS = (
    
    "💔 මල්ලියෝ!! ම්ං අර දෙන්නෙක්ට ආදරේ කරේ නෑනේ සුදු මල්ලියෝ!! 💔",
    "❤ ආදලෙයි 150GB ක්!! ❤",
    "ඕයි...! පෙට්ටිය කැඩුවනම් දැන් ලමය බාරගනින්!!",
    "තමුසෙ පිස්සෙක්නෙ ඕයි!",
    "මොනාද හුත්තෝ බලන්නේ...??",
    "කවුරුන් කෙසේ කීවද ඵරුස වචන භාවිතය ඔබේ අරක පණ නැති කරවයි!!",
    "හායි!! කෝමද පැටියෝ ❣❣",
    "මැරිලත් පැය හතරක් ආදරෙයි.. අම්මපා",
    "ටෞකන්ඩ මූ යකෝ!!",
    "ඔයා අදත් මට අර යෝගට් පානය දෙනවද...?",
    "චූ කරල නිදාගනින් අයියේ...",
    "ඔයා හරි සෝයි අනේ.. සෝ කියුට්... 😋",
    "අපි දෙන්න පැනල යමු.. හාද?? . ",
    "පල යන්න වේසාවෝ!!",
    "💔 මල්ලියෝ!! ම්ං අර දෙන්නෙක්ට ආදරේ කරේ නෑනේ සුදු මල්ලියෝ!! 💔",
    "අඩ්ඩේහ්..! මේ මොකද කරන්නේ??",
    "පොඩිකාලෙ බිව්වෙ පොල්කිරිද මල්ලී 🤑",
    "සීනි කන්න ආපු කූඹියො නෙමෙයි සීනි බෝතලේ ඇරපු ඔයයි වැරදි..",
    "කවුරු කොහොම් කිව්වත් \nකොත්තු කෑවොත් බඩ යන එක යනවමයි!",
    "ආදරෙයි.. මැණික ❤❤",
    "❤ ආදලෙයි 250GB ක්!! ❤",
    "හදුන්වාදෙන වැඩි දිගකින් යුත් fens.. \nභාවිත කර බලා වෙනස හඳුනාගන්න!",
    "ඔයාට suprise එකක් තියෙයි.. /kickme කියල ගහල බලන්නකෝ 😂",
    "ට්‍රැක්ටරය පැදවීමට මාගේ ඡායාරූප භාවිත කිරීමෙන් වලකින්න ",
    "ඔයාට suprise එකක් තියෙයි.. /kickme කියල ගහල බලන්නකෝ 😂",
    "මූ හුත්තෝ..",
    "මොන හුයන්නක්ද මේ",
    "පෝන් එක හිරවෙනවාද?? ගලක්මත තබා හොඳින් තලන්න නිසැක ප්‍රතිඵල",
    "ටොයිලට් එකේ ඉද්දි හෙඩ්සෙට් එක ගහන් සින්දු අහන්න එපා ඕයි...",
    "බලු කූඩුව ඇරියෙ මොකාද යකෝ!!",
    "බය තරහ ඇති කරවයි. තරහ වයිරය උපදවයි. වරිරය පසුතැවීම ඇති කරයි. ඔබ බයෙන් ජීවත්වන තුරු ලංකාවේ බඩු මිල පහත නොයයි",
    "රට්ටු හිනස්සන්න එපා මල්ලී.",
    "හදිසි අවස්තාවකදී ගිලන්රථයක් ගෙන්වා ගැනීමට 1990 අමතන්න",
    "අපේ ගෲප් එකත් එක්ක අදම සෙට් වෙන්න t.me/InfinityJE ❤",
    "ඔයාට කොච්චර සල්ලි තිබුනත් කොච්චර බලය තිබුනත් කොත්තු කෑවොත් බඩ යන එක නවත්තන්න ඔයාට බෑ 🌮🌮.",
    "💔 මල්ලියෝ!! ම්ං අර දෙන්නෙක්ට ආදරේ කරේ නෑනේ සුදු මල්ලියෝ!! 💔",
    "ටෞකන්ඩ මූ යකෝ!!!",
    "කවුරුන් කෙසේ කීවද ඵරුස වචන භාවිතය ඔබේ අරක පණ නැති කරවයි!",
    "පොඩිකාලෙ බිව්වෙ පොල්කිරිද මල්ලී 🤑",
    "කවුරු කොහොම් කිව්වත් \nකොත්තු කෑවොත් බඩ යන එක යනවමයි!",
    "රට්ටු හිනස්සන්න එපා මල්ලී.",
    "ආදරෙයි.. මැණික ❤❤",
    "💔 මල්ලියෝ!! ම්ං අර දෙන්නෙක්ට ආදරේ කරේ නෑනේ සුදු මල්ලියෝ!! 💔",
)

INSULTS_STRINGS = (
    
    "අපොයි ... එවැනි මෝඩ මෝඩයෙක්.",
    "බොන්න සහ ටයිප් නොකරන්න.",
    "මම හිතන්නේ ඔබ ගෙදර යා යුතුයි, නැත්නම් මානසික රැකවරණයක් ලබා ගත යුතුයි.",
    "විධානය හමු නොවීය. ඔබේ මොළය මෙන්.",
    "ඔබ ඔබව මෝඩයෙකු කරන බව ඔබට වැටහෙනවාද? පෙනෙන හැටියට එසේ නොවේ.",
    "ඔබට ඊට වඩා හොඳින් ටයිප් කළ හැකිය.",
    "බොට් රීතිය 544 9 වන වගන්තිය ඔබ වැනි මෝඩ මිනිසුන්ට පිළිතුරු දීම වළක්වයි.",
    "කණගාටුයි, අපි මොළය විකුණන්නේ නැත.",
    "මාව විශ්වාස කරන්න ඔබ සාමාන්‍ය කෙනෙක් නොවේ.",
    "මම හිතනවා ඔයාගේ මොළය අලුත් එකක් වගේ දැනෙනවා, ඔබ එය කිසි විටෙකත් භාවිතා නොකරන බව."
    "මට මාව මරා දැමීමට අවශ්‍ය නම් මම ඔබේ ඊගෝව තරණය කර ඔබගේ IQ වෙත පනින්නෙමි.",
    "Zombies මොළය කනවා ... ඔබ ආරක්ෂිතයි",
    "ඔබ පරිණාමය වූයේ වානරයන්ගෙන් නොවේ, ඔවුන් ඔබෙන් පරිණාමය විය.",
    "ඔබගේ වයස ඉක්මවා යන විට නැවත පැමිණ මා සමඟ කතා කරන්න.",
    "මම කියන්නේ නැහැ ඔයා මෝඩයෙක් කියලා, මම කියන්නේ හිතනකොට ඔයාට නරක වාසනාවක් ලැබුණා කියලා.",
    "ඔබ කතා කරන්නේ කුමන භාෂාවද? එය ගොන් කතා වගේ.",
    "මෝඩකම අපරාධයක් නොවේ, එබැවින් ඔබට යාමට නිදහස තිබේ.",
    "පරිණාමය ආපසු හැරවිය හැකි බවට ඔබ සාක්ෂි දරයි.",
    "ඔබේ වයස කීයදැයි මම ඔබෙන් අසමි. නමුත් මම දන්නවා ඔබට එතරම් ඉහළ අගයක් ගත නොහැකි බව."
    "පිටස්තරයෙකු ලෙස, මිනිස් සංහතිය ගැන ඔබ සිතන්නේ කුමක්ද?",
    "මොළය සියල්ලම නොවේ. ඔබේ නඩුවේ ඒවා කිසිවක් නැත.",
    "සාමාන්‍යයෙන් මිනිස්සු ජීවත් වෙලා ඉගෙන ගන්නවා. ඔයා ජීවත් වෙන්න.",
    "ඔබ මෙතරම් මෝඩ වන්නේ කුමක් දැයි මම නොදනිමි, නමුත් එය සැබවින්ම ක්‍රියාත්මක වේ.",
    "දිගටම කතා කරන්න, කවදාහරි ඔබ බුද්ධිමත් දෙයක් කියයි! (මට එය සැකයි)",
    "මට කම්පනය කරන්න, බුද්ධිමත් යමක් කියන්න.",
    "ඔබේ IQ ඔබේ සපත්තු ප්‍රමාණයට වඩා අඩුයි.",
    "අහෝ! ඔබේ ස්නායු සම්ප්‍රේෂක තවදුරටත් ක්‍රියාත්මක නොවේ.",
    "ඔයාට පිස්සුද මෝඩයා.",
    "සෑම කෙනෙකුම මෝඩ වීමට අයිතියක් ඇත. නමුත් ඔබ වරප්‍රසාදය අනිසි ලෙස භාවිතා කරයි."
    "මට කණගාටුයි, මම ඔබව මෝඩයෙකු ලෙස හැඳින්වූ විට ඔබේ හැඟීම් රිදෙව්වා. මම හිතුවේ ඔබ දැනටමත් එය දන්නා බවයි.",
    "ඔබ සයනයිඩ් රස බැලීමට උත්සාහ කළ යුතුයි.",
    "ඔබේ එන්සයිම මීයන්ගේ විෂ ජීර්ණය කිරීමට අදහස් කරයි.",
    "ඔබ සදහටම නිදා ගැනීමට උත්සාහ කළ යුතුයි.",
    "තුවක්කුවක් අරගෙන ඔබටම වෙඩි තියන්න.",
    "පැරෂුට් නොමැතිව ගුවන් යානයකින් පැනීමෙන් ඔබට ලෝක වාර්තාවක් තැබිය හැකිය.",
    "බීඑස් කතා කිරීම නවතා දුවන බුලට් දුම්රියක් ඉදිරිපිට පනින්න.",
    "ජලය වෙනුවට හයිඩ්‍රොක්ලෝරික් අම්ලය සමඟ ස්නානය කිරීමට උත්සාහ කරන්න.",
    "මෙය උත්සාහ කරන්න: ඔබ ඔබේ හුස්ම පැයක් පමණ දිය යට තබා ගන්නේ නම්, ඔබට එය සදහටම රඳවා ගත හැකිය.",
    "කොළ පාටට යන්න! ඔක්සිජන් ආශ්වාස කිරීම නවත්වන්න.",
    "දෙවියන් වහන්සේ ඔබව සොයමින් සිටියේය. ඔබ ඔහුව හමුවීමට පිටත්ව යා යුතුය.",
    "ඔබේ 100% දෙන්න. දැන් ගිහින් ලේ දන් දෙන්න.",
    "මහල් සියයක ගොඩනැගිල්ලකින් පැනීමට උත්සාහ කරන්න, නමුත් ඔබට එය කළ හැක්කේ එක් වරක් පමණි.",
    "ඔබ කිසි විටෙකත් එය භාවිතා නොකළ බව දැක ඔබේ මොළය පරිත්යාග කළ යුතුය.",
    "වෙඩි තැබීමේ පරාසයක ඉලක්කය සඳහා ස්වේච්ඡාවෙන් ඉදිරිපත් වන්න.",
    "හිස වෙඩි තැබීම විනෝදජනකයි. ඔබම එකක් ගන්න.",
    "ඔබ විශාල සුදු මෝරුන් සමඟ පිහිනීමට උත්සාහ කළ යුතුයි.",
    "ඔබ රතු පාටින් පින්තාරු කර ගොන් මැරතන් ධාවන තරඟයක යෙදිය යුතුය.",
    "නැවත ඉහළට නොගොස් ඔබේ ජීවිත කාලය පුරාම දිය යට රැඳී සිටිය හැකිය.",
    "කොහොමද ඔබ දින 1 ක් වගේ හුස්ම ගැනීම නවත්වන්නේ? ඒක නියමයි.",
    "ඔබ දෙදෙනාම කූඩුවක සිටින විට කොටියෙකු කුපිත කිරීමට උත්සාහ කරන්න.",
    "ඔබ කැනනයකින් මීටර් 100 ක් තරම් ඉහළට වෙඩි තැබීමට උත්සාහ කර තිබේද?",
    "ඔබ ඔබේ කටේ ටීඑන්ටී අල්ලාගෙන එය දැල්වීමට උත්සාහ කළ යුතුයි.",
    "RDX සමඟ විනෝද වීමට උත්සාහ කරන්න.",
    "ෆොජින් විෂ සහිත බව මට දැනගන්නට ලැබුණි. නමුත් මම හිතන්නේ ඔබ එය විනෝදය සඳහා ආශ්වාස නොකරනු ඇත.",
    "පෘථිවියේ ඔක්සිජන් අමතක කර අභ්‍යවකාශයට පිවිසෙන්න.",
    "ඔබ සර්පයන් සහ ඉණිමඟ සෙල්ලම් කිරීමට උත්සාහ කළ යුතුයි. සැබෑ සර්පයන් සහ ඉණිමඟක් නොමැතිව.",
    "HT වයර් කිහිපයක් මත නිරුවතින් නටන්න.",
    "සැබෑ ගිනි කන්ද ඔබට හොඳම පිහිනුම් තටාකයයි.",
    "ඔබ ගිනි කන්දක උණුසුම් ස්නානය කිරීමට උත්සාහ කළ යුතුයි.",
    "මිනී පෙට්ටියක එක් දිනක් ගත කිරීමට උත්සාහ කරන්න. එය සදහටම ඔබට අයිති වනු ඇත.",
    "ඔබ ඉදිරියේ සෙමින් චලනය වන නියුට්‍රෝනයකින් යුරේනියම් පහර දෙන්න. එය වටිනා අත්දැකීමක් වනු ඇත.",
    "ඔබ හිරු මතට පය තැබූ පළමු පුද්ගලයා විය හැකිය. උත්සාහ කර බලන්න.",
)

SLAP_TEMPLATES = (
    "{user1} {hits} {user2} with a {item}.",
    "{user1} {hits} {user2} in the face with a {item}.",
    "{user1} {hits} {user2} around a bit with a {item}.",
    "{user1} {throws} a {item} at {user2}.",
    "{user1} grabs a {item} and {throws} it at {user2}'s face.",
    "{user1} launches a {item} in {user2}'s general direction.",
    "{user1} starts slapping {user2} silly with a {item}.",
    "{user1} pins {user2} down and repeatedly {hits} them with a {item}.",
    "{user1} grabs up a {item} and {hits} {user2} with it.",
    "{user1} ties {user2} to a chair and {throws} a {item} at them.",
    "{user1} gave a friendly push to help {user2} learn to swim in lava."
)

ITEMS = (
    
    "වාත්තු යකඩ සායක්",
    "විශාල තුරුම්පුව",
    "බේස්බෝල් පිත්ත",
    "ක්රිකට් පිත්ත",
    "ලී වේවැල්",
    "නිය",
    "මුද්‍රණ යන්ත්‍රය",
    "සවල",
    "CRT මොනිටරය",
    "භෞතික විද්‍යා පෙළ පොත",
    "ටෝස්ටර්",
    "රිචඩ් ස්ටෝල්මන්ගේ ආලේඛ්‍ය චිත්‍රය",
    "රූපවාහිනිය",
    "ටොන් පහක ට්‍රක්",
    "ඩක් ටේප් රෝල්",
    "පොත",
    "ලැප්ටොප්",
    "පැරණි රූපවාහිනිය",
    "පාෂාණ මල්ල",
    "දේදුන්න තුරුම්පුව",
    "රබර් චිකන්",
    "ස්පයික් බැට්",
    "ගිනි නිවනය",
    "බර පාෂාණය",
    "කුණු කැබැල්ල",
    "මී මැසි",
    "කුණු වූ මස් කැබැල්ලක්",
    "වලහා",
    "ගඩොල් ටොන්",    
)

THROW = (
    
    "විසි",
    "පියාඹන",
    "චක්ස්",
    "හර්ස්",
)

HIT = (
    
   "පහර",
    "whacks",
    "කම්මුල්",
    "ස්මාක්ස්",
    "බාෂ්",
)

MARKDOWN_HELP = """
Markdown adalah alat pemformatan yang luar biasa yang didukung oleh telegram. {} memiliki beberapa peningkatan, untuk memastikan bahwa \
pesan yang disimpan diuraikan dengan benar, dan untuk memungkinkan Kamu membuat tombol.

- <code>_italic_</code>: membungkus teks dengan '_' akan menghasilkan teks yang miring
- <code>*bold*</code>: membungkus teks dengan '*' akan menghasilkan teks tebal
- <code>`code`</code>: membungkus teks dengan '`' akan menghasilkan teks monospace, juga dikenal sebagai 'code'
- <code>[sometext](someURL)</code>: ini akan membuat tautan - pesannya hanya akan menunjukkan <code> tulisan</code>, \
dan mengetuknya akan membuka halaman di <code>someURL</code>.
CONTOH: <code>[Tombol](buttonurl:example.com)</code>

- <code>[buttontext](buttonurl:someURL)</code>: ini adalah penyempurnaan khusus untuk memungkinkan pengguna untuk memiliki \
tombol telegram dalam markdown mereka. <code>buttontext</code> akan menjadi apa yang ditampilkan pada tombol, dan <code>someurl</code> \
akan menjadi url yang dibuka.
CONTOH: <code>[Tombol](buttonurl:example.com)</code>

Jika Kamu ingin beberapa tombol pada baris yang sama, gunakan: same, seperti:
<code>[one](buttonurl://example.com)
[two](buttonurl://google.com:same)</code>
Ini akan membuat dua tombol pada satu baris, bukan satu tombol per baris.
"""

IndonesianStrings = {
    "send-start": """Hi {}, my name {}! If you have any questions on how to use me, read /help - and then head to @YanaBotGroup.
I'm a group manager bot maintained by [this person](tg://user?id={654839744}). I'm a [Marie](https://github.com/PaulSonOfLars/tgbot) fork.
I'm built in python3, using the \
python-telegram-bot library, and am fully opensource - you can find what makes me tick\
[here](https://github.com/peaktogoo/HarukaAya))!
Feel free to submit pull requests on github, or to contact my support group, @EchelonTeam, with any bugs, questions \
or feature requests you might have :)
If you enjoying using me and/or would like to help me survive in the wild, hit /donate to help fund/upgrade my VPS!
""",

    "send-help": """Hey there! My name is *{}*.
I'm a modular group management bot with a few fun extras! Have a look at the following for an idea of some of the things I can help you with.
Main commands available:
 - /start: Cool command to check if the bot is alive or not
 - /help: PM's you this message.
 - /help <module name>: PM's you info about that module.
 - /donate: information about how to donate!
 - /lang: Change bot language
 - /settings:
   - in PM: will send you your settings for all supported modules.
   - in a group: will redirect you to pm, with all that chat's settings.
   {}
   """,

    "send-group-settings": """Hi there! There are quite a few settings for *{}* - go ahead and pick what
you're interested in.""",


    "Disabled connections to this chat for users": "Disabled connections to this chat for users",
    "Enabled connections to this chat for users": "Enabled connections to this chat for users",
    "Please enter on/yes/off/no in group!": "Please enter on/yes/off/no in group!",
    "Successfully connected to *{}*": "Successfully connected to *{}*",
    "Connection failed!": "Connection failed!",
    "Connections to this chat not allowed!": "Connections to this chat not allowed!",
    "Write chat ID to connect!": "Write chat ID to connect!",
    "Usage limited to PMs only!": "Usage limited to PMs only!",


#Misc
"RUNS-K": RUN_STRINGS,
"SLAP_TEMPLATES-K": SLAP_TEMPLATES,
"ITEMS-K": ITEMS,
"HIT-K": HIT,
"THROW-K": THROW,
"ITEMP-K": ITEMS,
"ITEMR-K": ITEMS,
"MARKDOWN_HELP-K": MARKDOWN_HELP,
"INSULTS-K": INSULTS_STRINGS,


    "The original sender, {}, has an ID of `{}`.\nThe forwarder, {}, has an ID of `{}`.":
        "The original sender, {}, has an ID of `{}`.\nThe forwarder, {}, has an ID of `{}`.",
    "{}'s id is `{}`.": "{}'s id is `{}`.",
    "Your id is `{}`.": "Your id is `{}`.",
    "This group's id is `{}`.": "මෙම කණ්ඩායමේ හැඳුනුම්පත `{}`.",

    "I can't extract a user from this.": "මට මෙයින් පරිශීලකයෙකු උපුටා ගත නොහැක.",
    "<b>User info</b>:": "<b>User info</b>:",
    "\nFirst Name: {}": "\nFirst Name: {}",
    "\nLast Name: {}": "\nLast Name: {}",
    "\nUsername: @{}": "\nUsername: @{}",
    "\nPermanent user link: {}": "\nPermanent user link: {}",
    "\nThis person is my owner - I would never do anything against them!":
        "\nමේ මගේ අයිතිකාරයා - මම එයාට විරුද්ධව මොනවත් කරන්නෙ නෑ!",
    "\nThis person is one of my sudo users! Nearly as powerful as my owner - so watch it.":
        "\nමෙම පුද්ගලයා මගේ සුඩෝ භාවිතා කරන්නෙකි! මගේ හිමිකරු තරම් බලවත්",
    "\nThis person is one of my support users! Not quite a sudo user, but can still gban you off the map.":
        "\nමෙම පුද්ගලයා මගේ සහායක පරිශීලකයෙකි! තරමක් සූඩෝ භාවිතා කරන්නෙකු නොවේ, නමුත් ඔබට සිතියමෙන් ඉවත් කළ හැකිය.",
    "\nThis person has been whitelisted! That means I'm not allowed to ban/kick them.":
        "\nමෙම පුද්ගලයා සුදු ලැයිස්තු ගත කර ඇත! ඒ කියන්නේ මට ඔවුන්ව තහනම් කරන්න / පයින් ගහන්න අවසර නැහැ.",

    "Its always banhammer time for me!": "එහි සෑම විටම මට කාලයයි!",

    "It's {} in {}": "It's {} in {}",

    "Please reply to a sticker to get its ID.": "එහි හැඳුනුම්පත ලබා ගැනීමට කරුණාකර ස්ටිකරයකට පිළිතුරු දෙන්න.",
    "Please reply to a sticker for me to upload its PNG.": "කරුණාකර මට PNG උඩුගත කිරීමට ස්ටිකරයකට පිළිතුරු දෙන්න.",

    "Write a location to check the weather.": "කාලගුණය පරීක්ෂා කිරීම සඳහා ස්ථානයක් ලියන්න.",
    "I will keep an eye on both happy and sad times!": "ප්‍රීතිමත් හා දුක්බර වේලාවන් දෙස මම විමසිල්ලෙන් සිටිමි!",
    "Today in {} is being {}, around {}°C.\n": "Today in {} is being {}, around {}°C.\n",
    "Sorry, location not found.": "කණගාටුයි, ස්ථානය හමු නොවීය.",

    "Deleting identifiable data...": "හඳුනාගත හැකි දත්ත මකා දැමීම ...",

    "Try forwarding the following message to me, and you'll see!":
        "පහත පණිවිඩය මා වෙත යොමු කිරීමට උත්සාහ කරන්න, එවිට ඔබට පෙනෙනු ඇත!",
    "/save test This is a markdown test. _italics_, *bold*, `code`, [URL](example.com) [button](buttonurl:github.com) [button2](buttonurl://google.com:same)":
    """/save test This is a markdown test. _italics_, *bold*, `code`, \
[URL](example.com)
[Botón](buttonurl:github.com)
[Botón2](buttonurl://google.com:same)""",

#Admin
"How am I meant to promote someone that's already an admin?": "දැනටමත් පරිපාලකයෙකු වන අයෙකු ප්‍රවර්ධනය කිරීමට මා අදහස් කරන්නේ කෙසේද?",
"I can't promote myself! Get an admin to do it for me.": "මට මාවම ප්‍රවර්ධනය කළ නොහැක! මා වෙනුවෙන් එය කිරීමට පරිපාලකයෙකු ලබා ගන්න.",
"Successfully promoted in *{}*!": "සාර්ථකව ප්‍රවර්ධනය කරන ලදි *{}*!",

"This person CREATED the chat, how would I demote them?": "මෙම පුද්ගලයා චැට් නිර්මාණය කළේය, මම ඔවුන්ව පහත් කරන්නේ කෙසේද?",
"Can't demote what wasn't promoted!": "ප්‍රවර්ධනය නොකළ දේ පහත් කළ නොහැක!",
"I can't demote myself!": "මට මාවම පහත් කරන්න බැහැ!",
"Successfully demoted in *{}*!": "සාර්ථකව පහත හෙලනු ලැබීය *{}*!",
"Could not demote. I might not be admin, or the admin status was appointed by another user, so I can't act upon them!": 
"පහත් කිරීමට නොහැකි විය. මම පරිපාලක නොවිය හැකිය, නැතහොත් පරිපාලක තත්ත්වය වෙනත් පරිශීලකයෙකු විසින් පත් කරන ලදි, එබැවින් මට ඔවුන් මත ක්‍රියා කළ නොහැක!",

"I don't have access to the invite link, try changing my permissions!": "මට ආරාධනා සබැඳියට ප්‍රවේශය නැත, මගේ අවසර වෙනස් කිරීමට උත්සාහ කරන්න!",
"I can only give you invite links for supergroups and channels, sorry!": "මට ඔබට ලබා දිය හැක්කේ සුපිරි කණ්ඩායම් සහ නාලිකා සඳහා ආරාධනා සබැඳි පමණි, සමාවෙන්න!",

"Admins in": "Admins in",
"this chat": "this chat",
" (Creator)": " (Creator)",

#AFK
"{} is now AFK!": "{} දැන් AFK!",
"{} is no longer AFK!": "{} තව දුරටත් AFK නෙමෙයි!",
"{} is AFK!": "{} is AFK!",
"{} is AFK! says its because of: \n{}": "{} is AFK! says its because of: \n{}",

#Antiflood
"I like to leave the flooding to natural disasters. But you, you were just a disappointment. Get out.":"කරුමක්කාරයන්ට ස්වාභාවිකව කෙලවෙන්නවට මම සාමන්‍යයෙන් කැමති. හැබැයි තෝ, තෝ මාර කරුමයක් උනා. පල යන්න.",
"I can't kick people here, give me permissions first! Until then, I'll disable antiflood.":"මට මෙතන මිනිස්සුන්ට පයින් ගහන්න බැහැ, මුලින්ම මට අවසර දෙන්න! එතෙක් මම ඇන්ටිෆ්ලූඩ් අක්‍රීය කරමි.",
"Antiflood has been disabled.": "ඇන්ටිෆ්ලූඩ් අක්‍රීය කර ඇත.",
"Antiflood has to be either 0 (disabled), or a number bigger than 3 (enabled)!":"ඇන්ටිෆ්ලූඩ් 0 (අක්‍රීය) හෝ 3 ට වඩා විශාල සංඛ්‍යාවක් (සක්‍රීය) විය යුතුය!",
"Antiflood has been updated and set to {}": "ඇන්ටිෆ්ලූඩ් යාවත්කාලීන කර සකසා ඇත {}",
"Unrecognised argument - please use a number, 'off', or 'no'.":"හඳුනා නොගත් තර්කය - කරුණාකර අංකයක් භාවිතා කරන්න, 'off', or 'no'.",
"I'm not currently enforcing flood control!": "මම දැනට flood control බලාත්මක කරන්නේ නැහැ!",
"I'm currently banning users if they send more than {} consecutive messages.":"පරිශීලකයින් අඛණ්ඩ පණිවිඩ {} ට වඩා එවන්නේ නම් ඔවුන් දැනට තහනම් කර ඇත.",

#Antispam
"I've enabled antispam security in this group. This will help protect you from spammers, unsavoury characters, and the biggest trolls.":"මම මෙම කණ්ඩායම තුළ ඇන්ටිස්පෑම් ආරක්ෂාව සක්‍රීය කර ඇත. මෙය අයාචිත තැපැල්, අනවශ්‍ය චරිත සහ විශාලතම ට්‍රෝලර් වලින් ඔබව ආරක්ෂා කිරීමට උපකාරී වේ.",

"I've disabled antispam security in this group. GBans wont affect your users anymore. You'll be less protected from any trolls and spammers though!":"මම මෙම කණ්ඩායමේ ඇන්ටිස්පෑම් ආරක්ෂාව අක්‍රීය කර ඇත. GBans තවදුරටත් ඔබේ පරිශීලකයින්ට බලපාන්නේ නැත. ඕනෑම ට්‍රෝලර් සහ ස්පෑම්කරුවන්ගෙන් ඔබට අඩු ආරක්ෂාවක් ලැබෙනු ඇත!",

"Give me some arguments to choose a setting! on/off, yes/no!\n\nYour current setting is: {}\nWhen True, any gbans that happen will also happen in your group. When False, they won't, leaving you at the possible mercy of spammers.":"පසුබිමක් තෝරා ගැනීමට මට තර්ක කිහිපයක් දෙන්න! on/off, yes/no!\n\nඔබගේ වර්තමාන සැකසුම: {}\nසත්‍ය වූ විට, සිදුවන ඕනෑම gbans ඔබේ කණ්ඩායමේ ද සිදුවනු ඇත. අසත්‍ය වූ විට, ඔවුන් එසේ නොකරනු ඇත, ස්පෑම්කරුවන්ගේ දයාවෙන් ඔබව අත්හරිනු ඇත.",

"Globally banned: <b>{}</b>": "ගෝලීය වශයෙන් තහනම්: <b>{}</b>",
"\nGlobally muted: <b>{}</b>": "\nගෝලීයව නිශ්ශබ්ද කර ඇත: <b>{}</b>",
"\nReason: {}": "\nReason: {}",

#Bans
    "I really wish I could ban admins...": "මම ඇත්තටම ප්‍රාර්ථනා කරනවා මට පරිපාලකයින් තහනම් කරන්න තිබ්බනම් කියල.... ඒත් බෑ...",
    "I'm not gonna BAN myself, are you crazy?": "මම මාවම තහනම් කරගන් නෑ.. තොට පිස්සුද??",
    "Banned!": "තහනම්!!",
    "Well damn, I can't ban that user.": "ලබ්බ..මට එම පරිශීලකයා තහනම් කළ නොහැක.",
    "You haven't specified a time to ban this user for!":
        "මෙම පරිශීලකයා තහනම් කිරීමට ඔබ කාලයක් නියම කර නැත!",
    "Banned! User will be banned for {}.": "කෙලියා... ඌට තව {} කාලෙකට මේ ගෲප තහනම්!!!.",

#Blacklist
    "<b>Current blacklisted words in {}:</b>\n": "<b>දැනට ලැයිස්තුගත කර ඇති වචන {}:</b>\n",
    "There are no blacklisted messages in <b>{}</b>!": "<b>{}</b>තුළ ලැයිස්තුගත කර ඇති පණිවිඩ නොමැත!",
    "Added <code>{}</code> to the blacklist in <b>{}</b>!":" <b>{}</b> හි ඇති අසාදු ලේඛනයට <code>{}</code> එකතු කරන ලදි!",
    "Tell me which words you would like to add to the blacklist.":"අසාදු ලේඛනයට ඔබ එකතු කිරීමට කැමති වචන මොනවාදැයි මට කියන්න.",
    "Removed <code>{}</code> from the blacklist in <b>{}</b>!":"<b>{}</b> හි ඇති අසාදු ලේඛනයෙන් <code>{}</code> ඉවත් කරන ලදි!",
    "This isn't a blacklisted trigger...!": "මෙය අසාදු ලේඛණගත කළ ප්‍රේරකයක් නොවේ ...!",
    "None of these triggers exist, so they weren't removed.":"මෙම ප්‍රේරක කිසිවක් නොපවතින බැවින් ඒවා ඉවත් නොකෙරුණි.",
    "Removed <code>{}</code> triggers from the blacklist in <b>{}</b>! {} did not exist, so were not removed.":"<b> {} </b> හි අසාදු ලේඛනයේ <code> {} </code> ප්‍රේරක ඉවත් කරන ලදි! {}නොපවතින බැවින් ඉවත් නොකළේය.",
    "Tell me which words you would like to remove from the blacklist.":"අසාදු ලේඛනයෙන් ඉවත් කිරීමට ඔබ කැමති වචන මොනවාදැයි මට කියන්න.",

    #Filters
    "*Filters in {}:*\n": "{} තුල සක්‍රීයව ඇති *Filters:*\n",
    "local filters": "දේශීය පෙරහන්",
    "*local filters:*\n": "*දේශීය පෙරහන්:*\n",
    "No filters in {}!": "{} හි ෆිල්ටර නැත!",
    "There is no note message - You can't JUST have buttons, you need a message to go with it!":"සටහන් පණිවිඩයක් නොමැත - ඔබට බොත්තම් තිබිය නොහැක, එය සමඟ යාමට ඔබට පණිවිඩයක් අවශ්‍යය!",
    "You didn't specify what to reply with!": "රිප්ලයි යවන්න ඕන එක ඔයා කිව්වෙ නෑ සුදූ",
    "Handler '{}' added in *{}*!": "වචනෙ '{}' add කරා *{}*!",
    "No filters are active in {}!": "මොනවත් filters active නෑ {}!",
    "Yep, I'll stop replying to that in *{}*." : "ඔයේ! මම ඒකට රිප්ලයි නොකර ඉන්නම් *{}*.",
    "That's not a current filter - run /filters for all active filters.":"එය වත්මන් පෙරණයක් නොවේ - සියලුම ක්‍රියාකාරී පෙරහන් සඳහා run /filters run කරන්න.",

    #Disable
    "Disabled the use of `{}` in *{}*": "*{}* හි {} භාවිතය අක්‍රීය කර ඇත",
    "That command can't be disabled": "එම විධානය අක්‍රිය කළ නොහැක",
    "What should I disable?": "මා අබල කළ යුත්තේ කුමක්ද?",

    "Enabled the use of `{}` in *{}*": "*{}* හි {} භාවිතය සක්‍රීය කර ඇත",
    "Is that even disabled?": "Is that even disabled?",
    "What should I enable?": "මා සක්‍රීය කළ යුත්තේ කුමක්ද?",

    "The following commands are toggleable:\n{}": "පහත දැක්වෙන විධානයන් ටොගල් කළ හැකිය:\n{}",
    "No commands can be disabled.": "කිසිදු විධානයක් අක්‍රිය කළ නොහැක.",
    "No commands are disabled in *{}*!": "විධාන කිසිවක් අක්‍රීය කර නැත *{}*!",
    "No commands are disabled!": "විධාන කිසිවක් අක්‍රීය කර නැත!",
    "The following commands are currently restricted in *{}*:\n{}":"*{}* හි පහත දැක්වෙන විධානයන් දැනට සීමා කර ඇත:\n{}",

#Locks
    "Locked {} messages for all non-admins!": "සියලුම පරිපාලකයින් නොවන අය සඳහා {} පණිවිඩ අගුළු දමා ඇත!",
    "What are you trying to lock...? Try /locktypes for the list of lockables":"ඔබ අගුලු දැමීමට උත්සාහ කරන්නේ කුමක්ද?...? අගුළු දැමීමේ ලැයිස්තුව සඳහා /locktypes උත්සාහ කරන්න",
    "I'm not an administrator, or haven't got delete rights.":"මම පරිපාලකයෙක් නොවේ, නැතහොත් මකාදැමීමේ අයිතියක් නොමැත.",
    "Unlocked {} for everyone!": "{} හැමෝටම Unlock කරා!",
    "What are you trying to unlock...? Try /locktypes for the list of lockables":"මොනවද unlock කරන්න හොයන්නෙ...? ගුළු දැමීමේ ලැයිස්තුව සඳහා /locktypes උත්සාහ කරන්න",
    "What are you trying to unlock...?": "මොනවද unlock කරන්න හොයන්නෙ...?",
    "I see a bot, and I've been told to stop them joining... but I'm not admin!":"මට බොට් එකක් පෙනේ, ඔවුන් මට සම්බන්ධ වීම නවත්වන ලෙස මට පවසා ඇත ... නමුත් මම පරිපාලක නොවේ!",
    "Only admins are allowed to add bots to this chat! Get outta here.":"ඇඩ්මින්ලට විත්‍රයි බොට්ල දාන්න දෙන්නෙ.. පල යන්න.",
    "There are no current locks in *{}*.": "මොනවත් *{}* එකේ ලොක් කරල නෑ.",
    "These are the locks in *{}*:": "මේ රෙද්දවල් ටික *{}* එකේ ලොක්ක්:",
    "this chat": "this chat",

#Log channel
    "Now, forward the /setlog to the group you want to tie this channel to!":
        "Now, forward the /setlog to the group you want to tie this channel to!",
    "This channel has been set as the log channel for {}.":
        "This channel has been set as the log channel for {}.",
    "Successfully set log channel!": "Successfully set log channel!",
    "*The steps to set a log channel are:*\n • add bot to the desired channel\n • send /setlog to the channel\n • forward the /setlog to the group\n":
        """*The steps to set a log channel are:*
 • add bot to the desired channel)
 • send /setlog to the channel
 • forward the /setlog to the group.""",

    "Channel has been unlinked from {}": "Channel has been unlinked from {}",
    "Log channel has been un-set.": "Log channel has been un-set.",
    "No log channel has been set yet!": "No log channel has been set yet!",

#Users
    "I've seen them in <code>{}</code> chats in total.":"මන් මූව දැක්කා චැට් <code>{}</code> කදි.",
    "I've seen them in... Wow. Are they stalking me? They're in all the same places I am... oh. It's me.":"මම ඔවුන්ව දැකලා තියෙනවා ... වාව්. ඔවුන් මට පයින් ගසනවාද? ඔවුන් එකම තැනක මම ... ඔහ්. ඒ මමයි.",

#Msg_deleting
    "Cannot delete all messages. The messages may be too old, I might not have delete rights, or this might not be a supergroup.":"සියලුම පණිවිඩ මකා දැමිය නොහැක. පණිවිඩ ඉතා පැරණි විය හැකිය, මට මකාදැමීමේ අයිතිවාසිකම් නොතිබිය හැකිය, නැතහොත් මෙය සුපිරි කණ්ඩායමක් නොවිය හැකිය.",
    "Purge complete.": "මකා දැමීම සාර්ථකයි",
    "Reply to a message to select where to start purging from.":"පිරිසිදු කිරීම ආරම්භ කළ යුත්තේ කොතැනින්ද යන්න තේරීමට පණිවිඩයකට පිළිතුරු දෙන්න.",
    "Whadya want to delete?": "මොනෞත්තක්ද ඩිලීට් කරන්න ඕන?",

#Muting
    "You'll need to either give me a username to mute, or reply to someone to be muted.":"නිශ්ශබ්ද කිරීම සඳහා ඔබට පරිශීලක නාමයක් ලබා දීමට හෝ නිශ්ශබ්ද කිරීමට යමෙකුට පිළිතුරු දීමට ඔබට අවශ්‍ය වනු ඇත.",
    "I'm not muting myself!": "මම මාවම මියුට් කරගන්නෙ නෑ",
    "Afraid I can't stop an admin from talking!": "මට පරිපාලකයෙකු කතා කිරීම නතර කළ නොහැක!",
    "You'll need to either give me a username to unmute, or reply to someone to be unmuted.":"එක්කෝ ඔබට නිශ්ශබ්ද කිරීමට පරිශීලක නාමයක් ලබා දිය යුතුය, නැතහොත් නිශ්ශබ්ද වීමට යමෙකුට පිළිතුරු දෙන්න.",
    "This user already has the right to speak in {}.": "මේ යකාට දැනටම කතා කරන්න අයිතිය තියනව {}.",
    "Yep, {} can start talking again in {}!": "ඔයේ!! {} ආපහු කතා කරන්න පටන් ගනින් {}!",
    "This user isn't even in the chat, unmuting them won't make them talk more than they already do!":"මෙම පරිශීලකයා කතාබස්වල පවා නොසිටින අතර, ඒවා නිශ්ශබ්ද කිරීමෙන් ඔවුන් දැනටමත් කතා කරනවාට වඩා කතා කිරීමට නොහැකි වනු ඇත!",
    "I really wish I could mute admins...": "මට හිතෙනව ඇඩ්මින්ල මියුට් කරන්න් තිබ්බනම් කියල!! ඒත් බෑ",
    "I'm not gonna MUTE myself, are you crazy?" : "මම මාවම මියුට් කරගන්නෙ නෑ.. තොට පිස්සුද???",
    "You haven't specified a time to mute this user for!":"මෙම පරිශීලකයා නිශ්ශබ්ද කිරීමට ඔබ කාලයක් නියම කර නැත!",
    "Muted for {} in {}!": "{} මාලෙකට {} හි මියුටඩ්!",
    "This user is already muted in {}!": "මූ දැනටම මියුටඩ් {}!",
    "Well damn, I can't mute that user.": "රෙද්ද!! මට ඌව මියුට් කරන්න බෑ",

    "You'll need to either give me a username to restrict, or reply to someone to be restricted.":"ඔබට සීමා කිරීමට පරිශීලක නාමයක් ලබා දීමට හෝ සීමා කිරීමට යමෙකුට පිළිතුරු දීමට ඔබට අවශ්‍ය වනු ඇත.",
    "I'm not restricting myself!": "මම මාවම සීමා කරන්නේ නැහැ!",
    "Afraid I can't restrict admins!": "මට පරිපාලකයින් සීමා කළ නොහැකියි",
    "{} is restricted from sending media in {}!": "{} ට මීඩියා එවීම තහනම් {}!තුල",
    "This user is already restricted in {}!": "මේ හාදයා දැනටම රෙස්ට්‍රික්ටඩ් {}!තුල",
    "This user isn't in the {}!": "Tමේ යකා {}! තුල නෑ",

    "You'll need to either give me a username to unrestrict, or reply to someone to be unrestricted.":"ඔබට එක්කෝ මට බාධාවකින් තොරව පරිශීලක නාමයක් ලබා දිය යුතුය, නැතහොත් සීමාවකින් තොරව යමෙකුට පිළිතුරු දෙන්න.",
    "This user already has the rights to send anything in {}.": "ඕනෑම දෙයක් යැවීමට මෙම පරිශීලකයාට දැනටමත් අයිතියක් ඇත {} තුල",
    "Yep, {} can send media again in {}!": "ඔයේ!! {} ආපහු මීඩියා එවන්න පුලාම් {}!",
    "This user isn't even in the chat, unrestricting them won't make them send anything than they already do!":
        "මෙම පරිශීලකයා කතාබස්වල පවා නොසිටින අතර, ඔවුන්ව සීමා කිරීම මඟින් ඔවුන් දැනටමත් කර ඇති දේට වඩා කිසිවක් යැවීමට නොහැකි වනු ඇත!",
    "I really wish I could restrict admins...": "මට ඇඩ්මින්ල රෙස්ට්‍රික්ට් කරන්න බෑ",
    "I'm not gonna RESTRICT myself, are you crazy?": "මම මාවම රෙස්ට්‍රික්ට් කරගන්නෙ නෑ.. පිස්සුවද යකෝ තොපිට",
    "You haven't specified a time to restrict this user for!": 
        "මෙම පරිශීලකයා සීමා කිරීමට ඔබ කාලයක් නියම කර නැත!",
    "Well damn, I can't restrict that user.": "හෙනම ගහපන් මට ඌට අරින්න බෑ.",
    "{} is muted in {}!": "{} නිහඬ කරල තියෙන්නෙ {} එකේ!",
    "Restricted from sending media for {} in {}!": "මාද්‍ය යැවීම {} සඳහා {} හි නවතා ඇත!",
    "Restricted for {} in {}!": "{} තහනම් {} හි!",

#Notes
    "Get rekt": "Get rekt.",
    "Invalid Chat ID provided!": "අවලංගු චැට් හැඳුනුම්පත ලබා දී ඇත!", #Connections 
    "You don't seem to be referring to a user.": "ඔබ පරිශීලකයෙකු වෙත යොමු වන බවක් නොපෙනේ.", #Admin, Bans, Muting
    "I can't seem to find this user": "මට මෙම පරිශීලකයා සොයා ගත නොහැක",
    "Yes": "Yes", #Antispam
    "No": "No", #Antispam

#__main__
    #Module names
        "Admin": "Admin",
        "AFK": "AFK",
        "AntiFlood": "AntiFlood",
        "Antispam Security": "Antispam Security",
        "Bans": "Bans",
        "Memes and etc.": "Memes and etc.",
        "Word Blacklists": "Word Blacklists",
        "Filters": "Filters",
        "Federations": "Federations",
        "Command disabling": "Command disabling",
        "Locks": "Locks",
        "Log Channels": "Log Channels",
        "Misc": "Misc",
        "Purges": "Purges",
        "Muting & Restricting": "Muting & Restricting",
        "Notes": "Notes",
        "Reporting": "Reporting",
        "RSS Feed": "RSS Feed",
        "Rules": "Rules",
        "Connections": "Connections",
        "Bios and Abouts": "Bios and Abouts",
        "Warnings": "Warnings",
        "Welcomes/Goodbyes": "Welcomes/Goodbyes",


#Some main stuff
"Ini adalah bantuan untuk modul *{}*:\n{}": "Ini adalah bantuan untuk modul *{}*:\n{}",
"Back": "Back",
"send-help": """ආයුබෝවන්! මගේ නම {}.
සිංහල භාශාවෙන් රන් වෙන එක්ම Group Admin Bot ට ඔයාව පිලිගන්නවා!!
Perintah tersedia:
 - /start: බොට්ව පටන් ගන්න
 - /help: උදව්
 - /help <Module name>: තෝරා ගත් මොඩියුලය පිලිබඳ විස්තර PM එකකින් ලබා දේ.
 - /donate: ආධාරයක් කිරීමට
 - /lang: භාශාව වෙනස් කිරීමට
 - /settings:
   -in PM: සහාය දක්වන සියලුම මොඩියුල සඳහා සැකසුම් ඔබ වෙත ලබාදේ.
   -in a group: සියලුම Chat settings ඔබට pm එකකින් redirect කරයි.
   
{}
   """,

"\nSemua perintah dapat digunakan dengan `/` atau `!`.\n": "\nසියලුම Commands `/` හෝ `!` සමග බාවිත කල හැක.\n",


#Module helps
"Admin_help": (""" - /adminlist | /admins: කතාබස් වල පරිපාලක ලැයිස්තුව
* පරිපාලක පමණි: *
  - /pin: පරිශීලකයින්ට නොතීසි ලබා දීම සඳහා 'ශබ්ද නගා' හෝ 'දැනුම් දෙන්න' එකතු කළ පණිවිඩයට නිහ ly ව ඇණ ගසන්න.
  - /unpin: දැනට ඇලවූ පණිවිඩය ඉවත් කරයි
  - /invitelink: invitelink ලබා ගනී
  - /Promote: පිළිතුරු දුන් පරිශීලකයා ප්‍රවර්ධනය කරයි
  - /demote: පරිශීලකයා පිළිතුරු දුන් අගය අඩු කරය """),

"AFK_help": ("""- / afk <reason>: ඔබම AFK ලෙස සලකුණු කරන්න.
  - brb <reason>: afk විධානයට සමානයි - නමුත් විධානයක් නොවේ.
AFK ලෙස සලකුණු කළ විට, ඕනෑම සඳහනකට ඔබ නොමැති බව පැවසීමට පණිවිඩයක් මගින් පිළිතුරු දෙනු ලැබේ!"""),

"AntiFlood_help": ("""
ඔබ සමූහයට සාමාජිකයන් එකතුවූවිට,පණිවිඩ් 100ක් පමණ යැවූ විට ඔබේ කතාබහ විනාශ වී යයි..
පේළි x කට වඩා පණිවිඩ යවන පරිශීලකයින් මත ක්‍රියා කිරීමට ඇන්ටිෆ්ලූඩ් ඔබට ඉඩ දෙයි.Actions are: ban/kick/mute/tban/tmute
Available commands are:
 - /flood: gets the current antiflood settings.
 - /setflood <number/off>: sets the number of messages at which to take action on a user."""),

"Locks_help": (""" ස්ටිකර් ඔබට කරදර කරනවාද? හෝ පුද්ගලයින් සම්බන්ධතා බෙදා ගැනීමෙන් වැළකී සිටීමට අවශ්‍යද? නැත්නම් පින්තූර? ඔබ නිවැරදි ස්ථානයේ!
අගුල් මොඩියුලය විදුලි පණිවුඩ ලෝකයේ පොදු අයිතම කිහිපයක් අගුළු දැමීමට ඉඩ දෙයි; බොට් ඒවා ස්වයංක්‍රීයව මකා දමනු ඇත!
Available commands are:
 - /lock <item(s)>: lock the usage of "item". Now, only admins will be able to use this type!
 - /unlock <item(s)>: unlock "item". Everyone can use them again.
 - /locks: list the lock status in the chat.
 - /locktypes: gets a list of all things that can be locked. (have a look at this!)
eg: lock stickers with:
/lock sticker"""),


"Filters_help": (""" filters සමඟ ඔබේ කතාබස් වඩාත් සජීවී කරන්න; බොට් සමහර වචන වලට පිළිතුරු දෙනු ඇත!
filters සිද්ධි සංවේදී නොවේ; ඔබේ ප්‍රේරක වචන යමෙකු පවසන සෑම අවස්ථාවකම, {} වෙනත් දෙයකට පිළිතුරු දෙනු ඇත! අවශ්‍ය නම් ඔබේම විධානයන් නිර්මාණය කිරීමට භාවිතා කළ හැකිය.
  - /filters: මෙම සංවාදයේ සියලුම ක්‍රියාකාරී පෙරහන් ලැයිස්තුගත කරන්න.
* පරිපාලක පමණි: *
  - /filter <keyword> <පිළිතුරු පණිවිඩය>: යමෙකු "වචනය" යැයි පවසන සෑම අවස්ථාවකම, බොට් "වාක්‍යයෙන්" පිළිතුරු දෙනු ඇත. බහු වචන filters සඳහා, පළමු වචනය උපුටා දක්වන්න.
  - /stop <filter keyword>: එම පෙරණය නවත්වන්න.
 
  filter සකසන්නේ කෙසේද යන්න පිළිබඳ උදාහරණයක් පහත පරිදි වේ:
`/filter හෙලෝ ආයුබෝවන්! ඔබට කොහොමද? `
බහු වචන පෙරණයක් සැකසිය හැක්කේ:
`/filter "හෙලෝ මිතුරා" ආයුබෝවන්! දිගු කලක් නොපෙනේ! `
ඔබට රූපයක්, gif, හෝ ස්ටිකර් හෝ වෙනත් දත්ත සුරැකීමට අවශ්‍ය නම්, පහත සඳහන් දේ කරන්න:
ස්ටිකර් එකකට හෝ ඔබ කැමති ඕනෑම දත්තයකට පිළිතුරු දෙන අතරතුර වචනය පෙරහන් කරන්න. දැන්, යමෙකු "වචනය" සඳහන් කරන සෑම අවස්ථාවකම එම ස්ටිකරය පිළිතුරක් ලෙස යවනු ලැබේ
දැන්, "හෙලෝ" යැයි කියන ඕනෑම කෙනෙකුට "ආයුබෝවන්! ඔබට කොහොමද?"""),


"Bans_help": """සමහර අය ප්‍රසිද්ධියේ තහනම් කළ යුතුය; spammers, annoyances, or just trolls.
මෙම මොඩියුලය ඔබට සමහර පොදු ක්‍රියා හෙළි කිරීමෙන් පහසුවෙන් එය කිරීමට ඉඩ සලසයි, එවිට සෑම කෙනෙකුම දකිනු ඇත!
Available commands are:
 - /ban: ඔබගේ සංවාදයෙන් පරිශීලකයෙකු තහනම් කරයි.
 - /banme: ඔබම තහනම් කරන්න
 - /tban: ඔබගේ චැට් එකෙන් පරිශීලකයෙකු තාවකාලිකව තහනම් කරයි. set time using int<d/h/m> (days hours minutes)
 - /unban: ඔබගේ කතාබසෙන් පරිශීලකයෙකු unban කරයි.
 - /sban: නිහඬව පරිශීලකයෙකු තහනම් කරයි (via handle, or reply)
 - /mute: ඔබගේ සංවාදයේ පරිශීලකයෙකු නිශ්ශබ්ද කරන්න.
 - /tmute: ඔබගේ සංවාදයේ පරිශීලකයෙකු තාවකාලිකව නිශ්ශබ්ද කරන්න. set time using int<d/h/m> (days hours minutes)
 - /unmute: ඔබගේ සංවාදයේ පරිශීලකයෙකු unmute කරන්න.
 - /kick: ඔබගේ සංවාදයෙන් පරිශීලකයෙකු පන්නයි.
 - /kickme: මෙය භාවිතා කරන පරිශීලකයින්, තමන්ටම පයින් ගසාගනී!
 යමෙකු තාවකාලිකව mute කිරීමේ උදාහරණයක්:
/tmute @username 2h; this mutes a user for 2 hours.""",

"Connections_help": """සමහර විට, ඔබට කණ්ඩායම් සංවාදයකට සටහන් සහ පෙරහන් කිහිපයක් එක් කිරීමට අවශ්‍ය නමුත් සියල්ලන්ම දැකීමට ඔබට අවශ්‍ය නැත; සම්බන්ධතා පැමිණෙන්නේ මෙහිදීය ...
මෙය ඔබට චැට් දත්ත ගබඩාවකට සම්බන්ධ වීමට ඉඩ සලසයි, ඒ ගැන කතාබහකින් තොරව ඒ සඳහා දේවල් එකතු කරන්න! පැහැදිලි හේතු නිසා, දේවල් එකතු කිරීම සඳහා ඔබ පරිපාලකයෙකු විය යුතුය; නමුත් ඕනෑම සාමාජිකයෙකුට ඔබගේ දත්ත බැලීමට හැකිය. (තහනම් / පයින් ගැසූ පරිශීලකයින්ට නොහැක!)
Actions are available with connected groups:
 • සටහන් බලන්න සහ සංස්කරණය කරන්න
 • ෆිල්ටර් බලන්න සහ සංස්කරණය කරන්න
 • අසාදු ලේඛණ බලන්න සහ සංස්කරණය කරන්න
 • පරිශීලකයින් Promote/demote කිරීම
 • පරිපාලක ලැයිස්තුව බලන්න, ආරාධිත සබැඳිය බලන්න
 • චැට් තුළ විධාන අක්‍රීය / සක්‍රීය කරන්න
 • චැට් භාවිතා කරන්නන් Mute/unmute කරන්න
 • චැට් භාවිතා කරන්නන් Restrict/unrestrict කරන්න
 • More in future!
 - ගෲප් එක තුල /connect or /connection යනුවෙන් ටයිප් කරන්න
 - /connection or /connect <chatid>: දුරස්ථ කතාබස් වෙත සම්බන්ධ වන්න
 - /disconnect: කතාබස් වලින් විසන්ධි කරන්න
 - /allowconnect on/yes/off/no: කණ්ඩායම් වලට සම්බන්ධ වීමට පරිශීලකයින්ට ඉඩ දෙන්න
 ඔබගේ චැට් එකේ /id විධානය භාවිතා කිරීමෙන් ඔබට චැට් අයිඩී ලබා ගත හැකිය. හැඳුනුම්පත negative  නම් පුදුම නොවන්න; සියලුම සුපිරි කණ්ඩායම් වලට negative අයිඩී ඇත.""",



"Reporting_help": """ - /report <reason>: balas pesan untuk melaporkannya ke admin.
 - @admin: balas pesan untuk melaporkannya ke admin.
CATATAN: tidak satu pun dari ini akan dipicu jika digunakan oleh admin
*Admin only:*
 - /reports <on/off>: mengubah pengaturan laporan, atau melihat status saat ini.
   - Jika dilakukan pada pm, matikan status Kamu.
   - Jika dalam obrolan, matikan status obrolan itu.""",

"Notes_help": """සටහන් සහිත අනාගත පරිශීලකයින් සඳහා දත්ත සුරකින්න!
අහඹු තොරතුරු තොරතුරු සුරැකීමට සටහන් විශිෂ්ටයි; දුරකථන අංකයක්, ලස්සන තෑග්ගක්, විහිලු පින්තූරයක් - ඕනෑම දෙයක්!
පවතින විධාන:
 - /save <word> <sentence>: එම වාක්‍යය "වචනය" නම් සටහනට සුරකින්න. පණිවිඩයකට පිළිතුරු දීමෙන් එම පණිවිඩය සුරැකෙනු ඇත. මාධ්ය මත පවා ක්රියා කරයි!
 - /get <word>: එම වචනයට සටහන ලියාපදිංචි කරන්න.
 - #<word>: වචනයට සමාන / ලබා ගන්න
 - /clear <word>: "වචනය" නම් සටහන මකන්න
 - /notes : වත්මන් සංවාදයේ සියලුම සටහන් ලැයිස්තුගත කරන්න
 - /saved /notes වලට සමාන වේ
සටහනක් සුරැකෙන ආකාරය පිළිබඳ උදාහරණයක් පහත පරිදි වේ:
/save data මෙය දත්ත කිහිපයක්!
දැන්, "/get data", හෝ "#data" භාවිතා කරන ඕනෑම කෙනෙකුට "මෙය දත්ත කිහිපයක්!"
ඔබට රූපයක්, gif, හෝ ස්ටිකර් හෝ වෙනත් දත්ත සුරැකීමට අවශ්‍ය නම්, පහත සඳහන් දේ කරන්න:
/save ස්ටිකර් එකකට හෝ ඔබ කැමති ඕනෑම දත්තයකට පිළිතුරු දෙන අතරතුර වචනය සුරකින්න. දැන්, "# වචනය" හි සටහනෙහි ස්ටිකරයක් අඩංගු වන අතර එය පිළිතුරක් ලෙස යවනු ලැබේ.
ඉඟිය: ආකෘතිකරණයකින් තොරව සටහනක් ලබා ගැනීමට, <notename> noformat භාවිතා කරන්න / ලබා ගන්න
මෙය නෝට්ටුව ලබාගෙන එය ආකෘතිකරණය නොකර යවනු ඇත; ඔබට අමු සලකුණු ලබා ගැනීම, පහසුවෙන් සංස්කරණය කිරීමට ඉඩ ලබා දේසටහන් සහිත අනාගත පරිශීලකයින් සඳහා දත්ත සුරකින්න!
""",



"Rules_help": """  - /rules: මෙම කතාබහ සඳහා නීති ලබා දෙයි.
*Admin only:*
 - /setrules <your rules here>: sමෙම කතාබහ සඳහා නීති සකසන්න.
 - /clearrules: මෙම කතාබහ සඳහා නීති ඉවත් කරන්න.
""",



"Word Blacklists_help":"""මිනිසුන් යම් යම් දේ පවසන විට ස්වයංක්‍රීයව ක්‍රියා කිරීමට ඔබට අසාදු ලේඛණ පෙරහන් සැකසිය හැකිය. මෙය සිදු කරන්නේ:
 - /addblacklist <blacklist trigger> <blacklist reason>: blacklists the trigger. You can set sentences by putting quotes around the reason.
 - /unblacklist <blacklist trigger>: stop blacklisting a certain blacklist trigger.
 - /rmblacklist <blacklist trigger>: same as /unblacklist
 - /blacklist: list all active blacklist filters
/addblacklist "the admins suck" Respect your admins!
This would delete any message containing 'the admins suck'.
If you've enabled an alternative blacklist mode, it will warn, ban, kick, or mute a user with a message specifying the reason.
Top tip:
Blacklists allow you to use some modifiers to match "unknown" characters. For example, you can use the ? character to match a single occurence of any non-whitespace character.
You could also use the * modifier, which matches any number of any character. If you want to blacklist urls, this will allow you to match the full thing. It matches every character except spaces. This is cool if you want to stop, for example, url shorteners.
For example, the following will ban any bit.ly link:
/addblacklist "bit.ly/*" We dont like shorteners!
If you wanted to only match bit.ly/ links followed by three characters, you could use:
/addblacklist "bit.ly/???" We dont like shorteners!
This would match bit.ly/abc, but not bit.ly/abcd.""",




"Welcomes/Goodbyes_help": """
සුභ පැතුම් මොඩියුලය සමඟ ඔබේ සාමාජිකයින්ට උණුසුම් පිළිගැනීමක් ලබා දෙන්න! නැත්නම් කනගාටුදායක සමුගැනීමක් ... රඳා පවතී!

Available commands are:
 - /welcome <on/off/yes/no>: පිළිගැනීමේ පණිවිඩ සක්‍රීය / අක්‍රීය කරයි. විකල්පයක් ලබා දී නොමැති නම්, වත්මන් පිළිගැනීමේ පණිවිඩය සහ පිළිගැනීමේ සැකසුම් නැවත ලබා දේ. 
 - /goodbye <on/off/yes/no>: සමුගැනීමේ පණිවිඩ සක්‍රීය / අක්‍රීය කරයි. විකල්පයක් ලබා නොදුනහොත්, වර්තමාන සමුගැනීමේ පණිවිඩය සහ සමුගැනීමේ සැකසුම් නැවත ලබා දේ.
 - /setwelcome <message>: ඔබගේ නව පිළිගැනීමේ පණිවිඩය සකසයි! සලකුණු කිරීම සහ බොත්තම් මෙන්ම පිරවුම් ද සහය දක්වයි.
 - /resetwelcome: ඔබගේ පිළිගැනීමේ පණිවිඩය පෙරනිමියට යලි සකසයි; ඔබ විසින් කරන ලද වෙනස්කම් මකා දැමීම.
 - /setgoodbye <message>: ඔබගේ නව සමුගැනීමේ පණිවිඩය සකසයි! සලකුණු කිරීම සහ බොත්තම් මෙන්ම පිරවුම් ද සහය දක්වයි.
 - /resetgoodbye: ඔබගේ සමුගැනීමේ පණිවිඩය පෙරනිමියට යලි සකසයි; ඔබ විසින් කරන ලද වෙනස්කම් මකා දැමීම.
 - /cleanwelcome <on/off/yes/no>: පැරණි පිළිගැනීමේ පණිවිඩ මකා දමයි; නව පුද්ගලයෙකු සම්බන්ධ වූ විට, පැරණි පණිවිඩය මැකෙනු ඇත.
 - /welcomemute <on/off/yes/no>: සම්බන්ධ වන සියලුම පරිශීලකයින් නිශ්ශබ්ද වන්න; පිළිගැනීමේ පණිවිඩයට බොත්තමක් එක් කර ඔවුන් නිශ්ශබ්ද කිරීමට. මෙයින් ඔප්පු වන්නේ ඔවුන් බොට් නොවන බවයි!
 - /welcomemutetime <Xw/d/h/m>: යම් වේලාවකට පසු පරිශීලකයෙකු පිළිගැනීමේ පණිවිඩයේ “Unmute” බොත්තම එබුවේ නැත්නම්, මෙම කාල පරිච්ඡේදයෙන් පසුව ඔවුන් ස්වයංක්‍රීයව නිශ්ශබ්ද වනු ඇත.
සටහන: නිශ්ශබ්ද කාලය සදහටම නැවත සැකසීමට ඔබට අවශ්‍ය නම්, use /welcomemutetime 0m. 0 == eternal!
 - /setmutetext <new text>: Welcome Mutes සක්‍රීය කිරීමෙන් ලබාගත් ""click here to prove you're human"" බොත්තම අභිරුචිකරණය කරන්න.
 - /resetmutetext: නිශ්ශබ්දතා බොත්තම සුපුරුදු පෙළට යලි සකසයි.

Read /markdownhelp to learn about formatting your text and mentioning new users when the join!

Fillings:
සඳහන් කළ පරිදි, පරිශීලක හෝ චැට් තොරතුරු සමඟ ඔබේ පිළිගැනීමේ පණිවිඩය පුරවා ගැනීමට ඔබට සමහර ටැග් භාවිතා කළ හැකිය; ඒ තියෙන්නේ:
{first}: පරිශීලකයාගේ මුල් නම.
{last}: පරිශීලකයාගේ අවසාන නම.
{fullname}: පරිශීලකයාගේ සම්පූර්ණ නම.
{username}: පරිශීලකයාගේ පරිශීලක නාමය; කිසිවක් නොමැති නම්, පරිශීලකයා සඳහන් කරයි.
{mention}:පරිශීලකයාගේ මුල් නම භාවිතා කරමින් සඳහන් කරයි.
{id}: පරිශීලකයාගේ හැඳුනුම්පත.
{chatname}: චැට්ගේ නම.

පිරවුම් භාවිතා කරන්නේ කෙසේද යන්න පිළිබඳ උදාහරණයක් නම්,
/setwelcome Hey there {first}! Welcome to {chatname}.

You can enable/disable welcome messages as such:
/welcome off

ඔබට රූපයක්, gif, හෝ ස්ටිකර් හෝ වෙනත් දත්ත සුරැකීමට අවශ්‍ය නම්, පහත සඳහන් දේ කරන්න:
/setwelcome ස්ටිකරයකට හෝ ඔබ කැමති ඕනෑම දත්තයකට පිළිතුරු දෙන අතරතුර. නව පරිශීලකයින් පිළිගැනීම සඳහා මෙම දත්ත දැන් යවනු ලැබේ.

Tip: use /welcome noformat to retrieve the unformatted welcome message.
This will retrieve the welcome message and send it without formatting it; getting you the raw markdown, allowing you to make easy edits.
This also works with /goodbye.
""",
"Federations_help": """අහ්, කණ්ඩායම් කළමනාකරණය. අයාචිත තැපැල්කරු ඔබේ කණ්ඩායමට ඇතුළු වන තෙක් සියල්ල විනෝදජනක වන අතර ඔබට එය අවහිර කළ යුතුය. එවිට ඔබ තව තවත් තහනම් කිරීම ආරම්භ කළ යුතු අතර තවත් බොහෝ දේ රිදෙනවා.
නමුත් ඔබට බොහෝ කණ්ඩායම් ඇති අතර, මෙම අයාචිත තැපැල්කරු ඔබගේ කණ්ඩායමක සිටීම ඔබට අවශ්‍ය නැත - ඔබට ගනුදෙනු කළ හැක්කේ කෙසේද? ඔබගේ සියලු කණ්ඩායම් තුළ ඔබ එය අතින් අවහිර කළ යුතුද?
තවදුරටත් නැත! සම්මේලනය සමඟ, ඔබට අනෙක් සියලුම කතාබස් සමඟ එක් චැට් අතිච්ඡාදනයකින් තහනමක් කළ හැකිය.
ඔබට පරිපාලක සම්මේලන පවා නම් කළ හැකිය, එබැවින් ඔබේ විශ්වාසදායක පරිපාලකයාට ඔබට ආරක්ෂා කිරීමට අවශ්‍ය සියලුම කතාබස් තහනම් කළ හැකිය.
Still the experimental stage, to make Federation can only be done by my maker
Command:
 - /newfed <fedname>: create a new Federation with the name given. Users are only allowed to have one Federation. This method can also be used to rename the Federation. (max. 64 characters)
 - /delfed: delete your Federation, and any information related to it. Will not cancel blocked users.
 - /fedinfo <FedID>: information about the specified Federation.
 - /joinfed <FedID>: join the current chat to the Federation. Only chat owners can do this. Every chat can only be in one Federation.
 - /leavefed <FedID>: leave the Federation given. Only chat owners can do this.
 - /fpromote <user>: promote Users to give fed admin. Fed owner only.
 - /fdemote <user>: drops the User from the admin Federation to a normal User. Fed owner only.
 - /fban <user>: ban users from all federations where this chat takes place, and executors have control over.
 - /unfban <user>: cancel User from all federations where this chat takes place, and that the executor has control over.
 - /setfrules: Arrange Federation rules.
 - /frules: See Federation regulations.
 - /chatfed: See the Federation in the current chat.
 - /fedadmins: Show Federation admin.
 - /fbanlist: Displays all users who are victimized at the Federation at this time.
 - /fedchats: Get all the chats that are connected in the Federation.
 - /importfbans: Reply to the Federation backup message file to import the banned list to the Federation now.
""",



#GDPR
"send-gdpr": """Your personal data has been deleted.\n\nNote that this will not unban \
you from any chats, as that is telegram data, not YanaBot data.
Flooding, warns, and gbans are also preserved, as of \
[this](https://ico.org.uk/for-organisations/guide-to-the-general-data-protection-regulation-gdpr/individual-rights/right-to-erasure/), "
which clearly states that the right to erasure does not apply \
\"for the performance of a task carried out in the public interest\", as is \
the case for the aforementioned pieces of data."""

}
